c5/src/Documents/Deviation/Deviation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Deviation</name>
  <registerRecords>AccumulationRegister.BankedHours</registerRecords>
  <registerRecords>InformationRegister.Hours</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Employees</name>
    <attributes>
      <name>Day</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Individual</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
    <attributes>
      <name>Minutes</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Time</name>
      <type>
        <types>EnumRef.Time</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/Time/Time.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Time</name>
  <enumValues>
    <name>Billable</name>
  </enumValues>
  <enumValues>
    <name>NonBillable</name>
  </enumValues>
  <enumValues>
    <name>Holiday</name>
  </enumValues>
  <enumValues>
    <name>Vacation</name>
  </enumValues>
  <enumValues>
    <name>ExtendedVacation</name>
  </enumValues>
  <enumValues>
    <name>Sickness</name>
  </enumValues>
  <enumValues>
    <name>Banked</name>
  </enumValues>
  <enumValues>
    <name>BankedUse</name>
  </enumValues>
  <enumValues>
    <name>Overtime</name>
  </enumValues>
  <enumValues>
    <name>DayOff</name>
  </enumValues>
  <enumValues>
    <name>Evening</name>
  </enumValues>
  <enumValues>
    <name>Night</name>
  </enumValues>
  <enumValues>
    <name>Absence</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Deviation/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

	
Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	DocumentPresentation.StandardFields ( Fields, StandardProcessing );

EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	DocumentPresentation.StandardPresentation ( Metadata.Documents.Deviation.Synonym, Data, Presentation, StandardProcessing );
	
EndProcedure

#region Posting

Function Post ( Env ) export
	
	getData ( Env );
	makeHours ( Env );
	makeBankedHours ( Env );
	flagRegisters ( Env );
	return true;
	
EndFunction

Procedure getData ( Env )

	sqlHours ( Env );
	sqlBankedHours ( Env );
	Env.Q.SetParameter ( "Ref", Env.Ref );
	SQL.Perform ( Env );
	
EndProcedure

Procedure sqlHours ( Env )
	
	s = "
	|// #Hours
	|select Employees.Employee as Employee, Employees.Day as Day, Employees.Time as Time, Employees.Minutes as Minutes
	|from Document.Deviation.Employees as Employees
	|where Employees.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlBankedHours ( Env )
	
	s = "
	|// #BankedHours
	|select Employees.Employee as Employee, Employees.Day as Day, Employees.Time as Time, Employees.Minutes as Minutes
	|from Document.Deviation.Employees as Employees
	|where Employees.Ref = &Ref
	|and Employees.Time in ( value ( Enum.Time.Banked ), value ( Enum.Time.BankedUse ) )
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure makeHours ( Env )

	recordset = Env.Registers.Hours;
	for each row in Env.Hours do
		movement = recordset.Add ();
		movement.Employee = row.Employee;
		movement.Day = row.Day;
		movement.Time = row.Time;
		movement.Minutes = row.Minutes;
	enddo;
	
EndProcedure

Procedure makeBankedHours ( Env )

	recordset = Env.Registers.BankedHours;
	banked = Enums.Time.Banked;
	for each row in Env.BankedHours do
		if ( row.Time = banked ) then
			movement = recordset.Add ();
		else
			movement = recordset.AddExpense ();
		endif; 
		movement.Employee = row.Employee;
		movement.Period = row.Day;
		movement.Minutes = row.Minutes;
	enddo;
	
EndProcedure

Procedure flagRegisters ( Env )
	
	registers = Env.Registers;
	registers.Hours.Write = true;
	registers.BankedHours.Write = true;
	
EndProcedure

#endregion

#endif
